app/controllers/agendas_controller.rb

def load_unidades
   if current_user.unidade_id== 53
       @unidades = Unidade.find(:all,:conditions => ["id < 11"], :order => 'nome ASC')
---
SELECT * FROM `unidades` WHERE (tipo_id = 1 or tipo_id = 4 or tipo_id = 7) ORDER BY nome ASC

def load_estagiarios
   if (current_user.unidade_id== 53)
       @estagiarios = Estagiario.find(:all, :conditions =>  ["desligado=0"], :order => 'nome ASC')
---
SELECT * FROM `estagiarios` WHERE (desligado=0) ORDER BY nome ASC

  def index
   define_layout
   @date = params[:month] ? Date.parse(params[:month]) : Date.today
   @search = Agenda.search(params[:search])
---
SELECT * FROM `agendas`