app/controllers/aulas_eventuals_controller.rb

    def index
        @date = params[:month] ? Date.parse(params[:month]) : Date.today
        @search = AulasEventual.search(params[:search])
---
SELECT * FROM `aulas_eventuals` WHERE (aulas_eventuals.unidade_id = 40) LIMIT 1

    def index2
        if current_user.unidade.tipo_id == 2   or current_user.unidade.tipo_id == 5 or  current_user.unidade.tipo_id == 8
            session[:infantil]=0
        else
            session[:infantil]=1
        end
            session[:unidade]=current_user.unidade_id

        @date = params[:month] ? Date.parse(params[:month]) : Date.today

        @search = AulasEventual.search(params[:search])
---
SELECT id FROM `aulas_eventuals` WHERE (unidade_id = 16 AND eventual_id =8 AND month(data) =6)

   def show
        @aulas_eventual = AulasEventual.find(params[:id])

        if session[:flag_show]==1
                session[:data]=0
                session[:flag_show]=0
                @falta = AulasFalta.find(:all, :conditions => ['dataI =? AND professor_id =? AND classe=?', @aulas_eventual.dataI, @aulas_eventual.professor_id, @aulas_eventual.aulas_falta.classe])
---
SELECT * FROM `aulas_eventuals` WHERE (`aulas_eventuals`.`id` = 11)
SELECT * FROM `eventuals` WHERE (`eventuals`.`id` = 8)
SELECT * FROM `aulas_faltas` WHERE (`aulas_faltas`.`id` = 27)
SELECT * FROM `classes` WHERE (`classes`.`id` = 1614)
SELECT * FROM `professors` WHERE (`professors`.`id` = 962)

    def create
            if session[:create]==0

                   w= session[:quant_falta]
                   t=0
                   i=0
                   if !params[:aulas_eventual][:dataI].nil?
                       a1=session[:dataI]=params[:aulas_eventual][:dataI].to_date
                       a2=session[:dataF]=params[:aulas_eventual][:dataF].to_date
                       a3=session[:data]= session[:dataF]-session[:dataI]
                   else
                        session[:data]= 0
                   end
                   while i < session[:quant_falta] do

                         @aulas_eventual = AulasEventual.new(params[:aulas_eventual])
                         @aulas_eventual.save
---
INSERT INTO `aulas_eventuals` (`aulas_falta_id`, `classe_id`, `data`, `unidade_id`, `eventual_id`, `periodo`, `categoria`, `updated_at`, `ano_letivo`, `obs`, `created_at`) VALUES(25, 1696, '2018-07-17', 16, 8, 'VESPERTINO', 'PB-I', '2018-07-17 14:55:37', 2018, 'asdas', '2018-07-17 14:55:37')

def nome_prof_eventual
        session[:unidade_id]=params[:aulas_eventual_unidade_id]
        @regiao= Unidade.find(:all, :conditions => ["id = ?", params[:aulas_eventual_unidade_id]])
---
SELECT nome, id FROM `unidades` WHERE (tipo_id = 2 OR tipo_id = 5 OR tipo_id = 8) ORDER BY nome ASC

def aulas_faltas_prof_classe
    t=0
  if session[:prof_falt]==1
      w1=session[:aulas_falta_id] = params[:aulas_eventual_aulas_falta_id]
       @aula_falta= AulasFalta.find(:all, :conditions => ['id=? AND data =?', params[:aulas_eventual_aulas_falta_id], session[:aulas_eventual_data]] )
       session[:professor_id]=@aula_falta[0].professor.id
       #@classe= Classe.find(:all, :joins => "INNER JOIN atribuicaos ON atribuicaos.classe_id = classes.id INNER JOIN professors ON atribuicaos.professor_id = professors.id ", :conditions=>[ "atribuicaos.professor_id = ? AND atribuicaos.ano_letivo = ?" , session[:professor_id], Time.now.year]  )
#       @classe= Classe.find(:all, :joins => "INNER JOIN "+session[:base]+"aulas.faltas ON aulas_faltas.classe = classes.classe_classe id", :conditions=>[ "'+session[:base]+'.aulas_faltas.id = ? ",session[:aulas_falta_id]]  )
### Alex 2019-05-24 12:31 Ini
       if @aula_falta[0].classe=="PA"
            session[:classe_classe]="PA"
            session[:classe_id]=0
       else
            @classe= Classe.find(:all, :joins => "INNER JOIN atribuicaos atr ON atr.classe_id = classes.id INNER JOIN professors  pro ON atr.professor_id = pro.id INNER JOIN  "+session[:baseinfo]+".aulas_faltas falt ON falt.classe = classes.classe_classe", :conditions=>[ "atr.professor_id = ? AND atr.ano_letivo = ? AND classes.unidade_id = falt.unidade_id AND falt.id =?" , session[:professor_id], Time.now.year, session[:aulas_falta_id] ]  )
---
SELECT * FROM `aulas_faltas` WHERE (professor_id='519' AND data ='2018-06-21')
SELECT nome, id FROM `unidades` WHERE (tipo_id = 2 OR tipo_id = 5 OR tipo_id = 8) ORDER BY nome ASC

                end
            end
        end
    @aulas_eventuals = AulasEventual.find(:all, :conditions =>  ["data between ? and ? AND ano_letivo=? AND eventual_id=?", session[:dataI].to_s, session[:dataF].to_s, Time.now.year, params[:aulas_eventual][:eventual_id]], :order => 'data ASC')
---
SELECT * FROM `aulas_eventuals` WHERE (data between '2018-07-01' and '2018-07-31' AND ano_letivo=2018 AND eventual_id='8') ORDER BY data ASC
SELECT * FROM `eventuals` WHERE (`eventuals`.`id` = 8)

    def load_iniciais
        #session[:base]= 'sisgered_development'
         #session[:base]= 'sis3ered_production'
             if current_user.has_role?('admin') or current_user.has_role?('SEDUC') or  current_user.has_role?('estagiario SEDUC')
                @unidades_infantil = Unidade.find(:all,  :select => 'nome, id',:conditions =>  ["tipo_id = 2 OR tipo_id = 5 OR tipo_id = 8 OR id=52"], :order => 'nome ASC')
---
SELECT nome, id FROM `unidades` WHERE (tipo_id = 2 OR tipo_id = 5 OR tipo_id = 8) ORDER BY nome ASC