app/controllers/aulas_faltas_controller.rb

    def index
        t=0
        @date = params[:month] ? Date.parse(params[:month]) : Date.today
        @date.strftime("%m")
        @search = AulasFalta.search(params[:search])
---
SELECT * FROM `aulas_faltas` WHERE (aulas_faltas.unidade_id = 40) LIMIT 1

    def index2
        t=0
        if current_user.unidade.tipo_id == 2   or current_user.unidade.tipo_id == 5 or  current_user.unidade.tipo_id == 8
            session[:infantil]= 0
        else
            session[:infantil]= 1
         end
        session[:unidade]= current_user.unidade_id
        @date = params[:month] ? Date.parse(params[:month]) : Date.today
        @search = AulasFalta.search(params[:search])
---
SELECT id FROM `aulas_faltas` WHERE (unidade_id = 16 AND professor_id =314 AND month(data) =6)

    def show
        @aulas_falta = AulasFalta.find(params[:id])
        @conta_falta= AulasFalta.find(:all, :conditions => ['dataI=? AND professor_id =?  ',@aulas_falta.dataI, @aulas_falta.professor_id])
---
SELECT * FROM `aulas_faltas` WHERE (`aulas_faltas`.`id` = 24)
SELECT * FROM `professors` WHERE (`professors`.`id` = 519)

 def create
if params[:aulas_falta][:dataF].nil?

     if session[:tipo]=='FALTA ABONADA'
                prof=Professor.find(:all, :conditions => ["id=?", params[:aulas_falta][:professor_id]])
                unid=Unidade.find(:all, :conditions => ["id=?", params[:aulas_falta][:unidade_id]])

                session[:aviso_fa]=params[:aulas_falta][:dataI].to_s+" | "+params[:aulas_falta][:periodo]+
                                   " | "+params[:aulas_falta][:classe]+" | "+params[:aulas_falta][:tipo]+
                                   " | "+unid[0].nome+" | "+prof[0].matricula.to_s+" | "+prof[0].nome+" | "+prof[0].funcao

       @faltasabonadas=AulasFalta.find_by_sql('SELECT count(*) AS qtde FROM aulas_faltas af JOIN '+session[:base]+'.professors pr ON af.professor_id=pr.id WHERE (periodo="'+session[:periodo]+'" AND data="'+(params[:aulas_falta][:dataI].to_date).to_s+'" AND pr.funcao2="'+session[:funcao2_professor]+'" AND af.tipo="FALTA ABONADA")')
       session[:faltas_abonadas]=@faltasabonadas[0].qtde.to_i
     else
       session[:faltas_abonadas]=0
     end
     session[:lim_faltas_abonadas]=8 # Limite máximo de faltas abonadas por dia para cadastro normal (exceto SUPERVISORAS e ADMIN)
     if (session[:faltas_abonadas] < session[:lim_faltas_abonadas]) or current_user.has_role?('SEDUC') or current_user.has_role?('admin')
                    session[:flag]=0
                    @aulas_falta = AulasFalta.new(params[:aulas_falta])
                    @aulas_falta.data=params[:aulas_falta][:dataI]
                    @aulas_falta.dataF=params[:aulas_falta][:dataI]
                    @aulas_falta.dataI=params[:aulas_falta][:dataI]
                    @aulas_falta.ano_letivo =  Time.now.year
                    @aulas_falta.funcao = session[:funcao]
                    @aulas_falta.setor = session[:setor]
                    #w3=@aulas_falta.classe = session[:profclasse]
                    #w4=@aulas_falta.periodo = session[:classeper]
                    @aulas_falta.periodo = session[:periodo]
                    respond_to do |format|
                        if @aulas_falta.save
---
SELECT nome, id FROM `unidades` WHERE (tipo_id = 2 OR tipo_id = 5 OR tipo_id = 8) ORDER BY nome ASC
INSERT INTO `aulas_faltas` (`funcionario_id`, `professor_id`, `obs`, `periodo`, `funcao`, `data`, `created_at`, `updated_at`, `tipo`, `ano_letivo`, `unidade_id`, `setor`, `classe`) VALUES(NULL, 792, '', 'INTEGRAL', 'PROFESSOR', '2018-07-27', '2018-07-26 14:30:31', '2018-07-26 14:30:31', 'ATESTADO MÉDICO', 2018, 16, 'PEDAGÓGICO', 'MULTS ')

    def destroy
        @aulas_falta = AulasFalta.find(params[:id])
        @aulas_falta.destroy
---
SELECT * FROM `aulas_faltas` WHERE (`aulas_faltas`.`id` = 49)
DELETE FROM `aulas_faltas` WHERE `id` = 49

    def nome_falta

        session[:aulas_falta_unidade_id]=params[:aulas_falta_unidade_id]
        @tipo_unidade = Unidade.find(:all, :select => ['id, tipo_id'] , :conditions => ['id =?',  params[:aulas_falta_unidade_id]]  )
         if @tipo_unidade[0].tipo_id == 8 or @tipo_unidade[0].tipo_id == 5 or @tipo_unidade[0].tipo_id == 2
           # @faltas = AulasFalta.find(:all, :select=>[:professor_id], :conditions => ['data = ? AND  periodo=?', session[:aulas_falta_dataI], session[:periodo]])
            @professores = Professor.find(:all, :conditions => ['unidade_id =? or unidade_id=54', params[:aulas_falta_unidade_id]], :order => 'unidade_id ASC, nome ASC ' )
            #@professores_cat = Professor.find(:all, :select => " distinct(professors.id), CONCAT(professors.nome, ' - ',professors.funcao) AS prof_funcao, unidade_id",:joins => "INNER JOIN  atribuicaos  ON  professors.id = atribuicaos.professor_id INNER JOIN  disciplinas  ON  disciplinas.id = atribuicaos.disciplina_id", :conditions => ['(unidade_id =? or unidade_id=54) AND atribuicaos.ano_letivo = ? AND disciplinas.curriculo= "I"  ', params[:aulas_falta_unidade_id], Time.now.year], :order => 'professors.unidade_id ASC, professors.nome ASC ' )
            #@professores_cat = Professor.find(:all, :select => " distinct(professorss.id), CONCAT(professors.nome, ' - ',professors.funcao) AS prof_funcao, unidade_id",:joins => "INNER JOIN  atribuicaos  ON  professors.id = atribuicaos.professor_id INNER JOIN  disciplinas  ON  disciplinas.id = atribuicaos.disciplina_id", :conditions => ['(unidade_id =? or unidade_id=54) AND atribuicaos.ano_letivo = ? AND disciplinas.curriculo= "I" AND professors.id NOT IN (?) ', params[:aulas_falta_unidade_id], Time.now.year, @faltas], :order => 'professors.unidade_id ASC, professors.nome ASC ' )
            @professores_cat = Professor.find_by_sql("SELECT  distinct(professors.id), CONCAT(professors.nome, ' - ',professors.funcao) AS prof_funcao, unidade_id FROM `professors`  INNER JOIN  atribuicaos  ON  professors.id = atribuicaos.professor_id INNER JOIN  disciplinas  ON  disciplinas.id = atribuicaos.disciplina_id WHERE ((unidade_id="+params[:aulas_falta_unidade_id]+" or unidade_id=54) AND atribuicaos.ano_letivo = 2019 AND disciplinas.curriculo= 'I' AND professors.id NOT IN (SELECT af.professor_id FROM "+session[:baseinfo]+".aulas_faltas af WHERE (af.data = '"+session[:aulas_falta_dataI]+"' AND  (af.periodo='"+session[:periodo]+"' OR af.periodo='INTEGRAL'))) )  ORDER BY professors.unidade_id ASC, professors.nome ASC ")
            #@professores1 = Eventual.find_by_sql("SELECT eventuals.id, professors.nome FROM eventuals INNER JOIN  professors  ON  professors.id = eventuals.professor_id INNER JOIN  unidades  ON  unidades.id = professors.unidade_id WHERE eventuals.periodo = '"+session[:periodo_prof_eventual]+"' AND eventuals.categoria = '"+session[:caregoria_prof_eventual]+"'AND eventuals.unidade_id = "+session[:aulas_eventual_unidade_id]+" AND eventuals.id NOT IN (SELECT aulas_eventuals.eventual_id FROM aulas_eventuals WHERE aulas_eventuals.ano_letivo ="+(Time.now.year).to_s+" AND data = '"+session[:aulas_eventual_data].to_s+"' AND aulas_eventuals.unidade_id = "+session[:aulas_eventual_unidade_id]+" order by unidades.regiao_id ASC ) order by unidades.regiao_id ASC")

           @funcionarios = Funcionario.find(:all, :conditions => ['unidade_id =? ', params[:aulas_falta_unidade_id]], :order => 'nome ASC')
---
SELECT nome, id FROM `unidades` WHERE (tipo_id = 2 OR tipo_id = 5 OR tipo_id = 8) ORDER BY nome ASC
SELECT * FROM `professors` WHERE (unidade_id ='16' or unidade_id=54) ORDER BY nome ASC , unidade_id ASC
SELECT * FROM `funcionarios` WHERE (unidade_id ='16' ) ORDER BY nome ASC

        session[:mostra_faltas_professor] = 1
        session[:aulas_falta_unidade_id] = params[:aulas_falta][:unidade_id]
        if (session[:verifica_unidade_id]=='52')
            @aulas_faltas = AulasFalta.find(:all, :conditions =>  ["data between ? and ?  AND ano_letivo=? ", session[:dataI].to_s, session[:dataF].to_s, Time.now.year], :order => 'data ASC')
---
SELECT * FROM `aulas_faltas` WHERE (data between '2018-07-24' and '2018-07-26' AND ano_letivo=2018 AND professor_id='537') ORDER BY data ASC

        session[:mostra_faltas_professor] = 1
        session[:aulas_falta_unidade_id] = params[:aulas_falta][:unidade_id]
        if (session[:verifica_unidade_id]=='52')
            @aulas_faltas = AulasFalta.find(:all, :conditions =>  ["data between ? and ?  AND ano_letivo=? ", session[:dataI].to_s, session[:dataF].to_s, Time.now.year], :order => 'data ASC')
---
SELECT * FROM `aulas_faltas` WHERE (data between '2018-06-01' and '2018-06-30' AND ano_letivo=2018 AND unidade_id='40') ORDER BY data ASC

                end
            end
        end
        @aulas_faltas = AulasFalta.find(:all, :conditions =>  ["data between ? and ? AND ano_letivo=? AND professor_id=?", session[:dataI].to_s, session[:dataF].to_s, Time.now.year, params[:aulas_falta][:professor_id]], :order => 'data ASC')
---
SELECT * FROM `aulas_faltas` WHERE (data between '2018-07-01' and '2018-07-31' AND ano_letivo=2018 AND professor_id='788') ORDER BY data ASC

    def impressao_faltas_dia
        if (session[:verifica_unidade_id]=='52')
            @aulas_faltas = AulasFalta.find(:all, :conditions =>  ["data between ? and ?  AND ano_letivo=? ", session[:dataI].to_s, session[:dataF].to_s, Time.now.year], :order => 'data ASC')
---
SELECT * FROM `aulas_faltas` WHERE (data between '2018-07-25' and '2018-07-25' AND ano_letivo=2018 AND unidade_id=NULL) ORDER BY data ASC

    def impressao_faltas
        if (session[:verifica_unidade_id]=='52')
            @aulas_faltas = AulasFalta.find(:all, :conditions =>  ["data between ? and ?  AND ano_letivo=? ", session[:dataI].to_s, session[:dataF].to_s, Time.now.year], :order => 'data ASC')
---
SELECT * FROM `aulas_faltas` WHERE (data between '2018-07-25' and '2018-07-25' AND ano_letivo=2018 AND unidade_id=NULL) ORDER BY data ASC

    def setor_funcionario
        session[:func_id]=params[:aulas_falta_funcionario_id]
        @funcionario_setor= Funcionario.find(:all , :select => ['funcao, setor'], :conditions => ['id =?',session[:func_id]])
---
SELECT funcao, setor FROM `funcionarios` WHERE (id ='1014')

  def load_iniciais
         #session[:base]= 'sisgered_development'
         #session[:base]= 'sisgered_production'
        if current_user.has_role?('admin') or current_user.has_role?('SEDUC') or current_user.has_role?('estagiario SEDUC')
            @unidades_infantil = Unidade.find(:all,  :select => 'nome, id',:conditions =>  ["(tipo_id = 2 OR tipo_id = 5 OR tipo_id = 8) OR id = 52"], :order => 'nome ASC')
---
SELECT nome, id FROM `unidades` WHERE (tipo_id = 2 OR tipo_id = 5 OR tipo_id = 8) ORDER BY nome ASC