app/controllers/chamados_controller.rb

SELECT * FROM `chamados` WHERE (situacao_chamado_id != 12) ORDER BY situacao_chamado_id,data_sol DESC
SELECT * FROM `unidades` WHERE (`unidades`.`id` = 43)
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
---
  def index
    define_layout
      if (params[:search].nil? || params[:search].empty?)

        @chamados_totais = Chamado.all
        #Todos chamados não encerrados
        @chamados = Chamado.nao_encerrado

        #nivel de chamado técnico
        @chamados_aberto = Chamado.aberto
        @chamados_encerrado = Chamado.encerrado
        @chamados_terceiros = Chamado.terceiro
        @chamados_motoristas = Chamado.motorista
        @chamados_compras = Chamado.compras
        @chamados_atendimento = Chamado.atendimento
        @chamados_externo = Chamado.externo

        # Tipos de problemas
        @chamados_internet =  @chamados.problema_internet
        @chamados_impressora = @chamados.problema_impressora
        @chamados_hardware = @chamados.problema_hardware
        @chamados_software = @chamados.problema_software
        @chamados_rede = @chamados.problema_rede
        @chamados_so = @chamados.problema_so
        @chamados_user = @chamados.problema_user
        @chamados_ndefinido = @chamados.problema_nao_definido
        @chamados_outros = @chamados.outros_problema
        @chamados_servidor = @chamados.problema_servidor
        $var = 0
      else
        @chamados = Chamado.find(:all, :joins => :unidade, :conditions => ["unidades.nome like ?", "%" + params[:search].to_s + "%"], :order => 'situacao_chamado_id,nome DESC')

SELECT * FROM `chamados` WHERE (situacao_chamado_id != 12) ORDER BY id ASC
---
  def show
   define_layout
    @chamados = Chamado.find(params[:id])

INSERT INTO `chamados` (`solicitante`, `situacao_chamado_id`, `data_enc`, `forma_sol`, `created_at`, `obs`, `updated_at`, `problema`, `estagiario_id`, `patrimonio`, `email`, `data_aten`, `tipos_problema_id`, `local`, `procedimentos`, `unidade_id`, `data_sol`) VALUES('DULCINÉIA PIRES', 1, NULL, '', '2018-06-21 13:38:35', '', '2018-06-21 13:38:35', 'PRECISO PERMITIR O ACESSO DO NOTEBOOK DA PEDAGOGA E DO QUE USO. COM A MUDANÇA DA INTERNET(EMPRESA NOVA QUE PRESTA SERVIÇOS) NÃO CONSEGUIMOS MAIS ACESSAR.', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 26, '2018-06-21 13:37:00')
---
  def create
    define_layout
    @chamados = Chamado.new(params[:chamado])
    respond_to do |format|
      if @chamados.save

SELECT * FROM `chamados` WHERE (situacao_chamado_id != 12) ORDER BY id ASC
---
  def ordemservico
    define_layout
    @chamados = Chamado.find(params[:id])

SELECT * FROM `tipos_problemas` WHERE (`tipos_problemas`.`id` = 10)
---
  def load_tipos
    @tipos = TiposProblema.find(:all)

SELECT * FROM `chamados` WHERE (situacao_chamado_id != 12) ORDER BY id ASC
SELECT * FROM `situacao_chamados` WHERE (`situacao_chamados`.`id` = 1)
---
  def load_situacaos
    @situacaos = SituacaoChamado.find(:all)

SELECT * FROM `estagiarios` WHERE (desligado=0 and unidade_id=53 and id<>2 and id<>47) ORDER BY nome ASC
---
  def load_estagiarios
    @estagiarios = Estagiario.find(:all, :order => 'nome ASC',:conditions => ['desligado=?',0])

SELECT * FROM `unidades` WHERE (`unidades`.`id` = 26)
---
  def load_unidades
    @unidades = Unidade.find(:all, :order => 'nome ASC')