app/controllers/estagiarios_controller.rb

  def show
    @estagiarios = Estagiario.find(params[:id])
---
SELECT * FROM `estagiarios` WHERE (flag=0 and desligado=0) ORDER BY nome ASC

  def load_estagiariosa
      @estagiariosa = Estagiario.find(:all, :order => 'nome ASC',:conditions => ['flag=? and desligado=?',0,0])
---
SELECT * FROM `estagiarios` WHERE (flag=0 and desligado=0) ORDER BY nome ASC

  def load_unidades
      @unidades = Unidade.find(:all, :order => 'nome ASC')
---
SELECT * FROM `unidades` WHERE (`unidades`.`id` = 28)