app/controllers/eventuals_controller.rb

  def show
    @eventual = Eventual.find(params[:id])
---
SELECT * FROM `eventuals` WHERE (`eventuals`.`id` = 8)

def  dados_unidade
   @unidade= Unidade.find(:all, :conditions => ["id =?", params[:eventual_unidade_id]])
---
SELECT * FROM `unidades` WHERE (id=52)

  def edit
    @eventual = Eventual.find(params[:id])
---
SELECT * FROM `eventuals` WHERE (`eventuals`.`id` = 10)

  def create
    @eventual = Eventual.new(params[:eventual])
    @eventual.ano_letivo = Time.now.year
    @eventual.regiao_id = session[:regiao_id]


    @duplicidade= Eventual.find(:all, :conditions => ['professor_id =? AND  periodo=?' , @eventual.professor_id, @eventual.periodo])
    if   @duplicidade.empty?
        respond_to do |format|
          if @eventual.save
---
SELECT id FROM `eventuals` WHERE (ano_letivo=2018)
INSERT INTO `eventuals` (`categoria`, `professor_id`, `disponibilidade`, `ano_letivo`, `contato`, `created_at`, `updated_at`, `periodo`, `unidade_id`, `obs`) VALUES('ADI', 169, 'SDASDASD', 2018, '', '2018-07-17 16:49:49', '2018-07-17 16:49:49', 'INTEGRAL', 16, 'ASDASDASD\r\nASXXXXXX\r\n\nASDASDASD\r\nASXXXXXX\r\n\n')

  def update
    @eventual = Eventual.find(params[:id])
    respond_to do |format|
      if @eventual.update_attributes(params[:eventual])
---
SELECT * FROM `eventuals` WHERE (`eventuals`.`id` = 61)
UPDATE `eventuals` SET `updated_at` = '2018-07-26 18:49:28', `nao_atua` = 1 WHERE `id` = 61

  def lista_professor
        @professors = Eventual.find(:all, :conditions => ['id= ?', params[:eventual_professor_id]])
---
SELECT id FROM `eventuals` WHERE (ano_letivo=2018)

    def load_iniciais
         #session[:base]= 'sisgered_development'
         #session[:base]= 'sisgered_production'
            @unidades = Unidade.find(:all, :order => 'nome ASC')
            @eventuals = Eventual.find(:all,:select => "id", :conditions => ['ano_letivo=?', Time.now.year])
            #@professores= Professor.find_by_sql("SELECT id, nome FROM professors WHERE `id` NOT IN ( SELECT professor_id FROM "+session[:baseinfo]+".eventuals  )ORDER BY nome ASC" )
            @professores= Professor.find(:all, :conditions => ['desligado = 0'], :order => 'nome ASC' )
---
SELECT * FROM `unidades` WHERE (`unidades`.`id` = 50)
SELECT id FROM `eventuals` WHERE (ano_letivo=2018)
SELECT * FROM `professors` WHERE (funcao like '%VESPERTINO%' AND desligado = 0) ORDER BY nome ASC

 def consultaeventual
    if params[:type_of].to_i == 3
          @professors = Eventual.find(:all, :joins => "INNER JOIN "+session[:base]+".professors ON eventuals.professor_id = professors.id",:order => 'professors.nome ASC')
---
SELECT `eventuals`.* FROM `eventuals` INNER JOIN sisgered_development.professors ON eventuals.professor_id = professors.id WHERE (eventuals.categoria like '%Digite parte da busca%') ORDER BY professors.nome ASC

  def lista_professor_unidade
    #@professors = Professor.find(:all, :conditions => ['desligado =0 and unidade_id= ?', params[:unidade_id]])
    @professors = Eventual.find(:all, :joins => "INNER JOIN "+session[:base]+".professors ON eventuals.professor_id = professors.id WHERE eventuals.unidade_id = "+params[:unidade_id]+"  ",:order => 'professors.nome ASC')
---
SELECT `eventuals`.* FROM `eventuals` INNER JOIN sisgered_development.professors ON eventuals.professor_id = professors.id WHERE eventuals.unidade_id = 16 ORDER BY professors.nome ASC