app/controllers/mmanutencaos_controller.rb

 def load_funcionarios
   if current_user.has_role?('administrador') or current_user.has_role?('admin_manutencao')
      @funcionarios = Funcionario.find(:all,:conditions => ['desligado=?',0], :order => 'nome ASC' )
   else
      @funcionarios = Funcionario.find(:all, :joins =>:chefia, :conditions => ['funcionarios.desligado=? and chefias.user_id =?',0, current_user], :order => 'nome ASC' )
---
SELECT * FROM `chefias` WHERE (`chefias`.`id` = 11)
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1

  def load_situacaos
    @situacaos = SituacaoManutencao.find(:all)
---
SELECT * FROM `situacao_manutencaos` WHERE (`situacao_manutencaos`.`id` = 4)