app/controllers/orc_uni_despesas_controller.rb

SELECT * FROM `orc_uni_despesas` WHERE (ano = 2018)
---
  def index
    @orc_uni_despesas = OrcUniDespesa.all(:conditions => ["ano = ?", Time.now.year])