app/controllers/orc_empenhos_controller.rb

SELECT * FROM `orc_pedido_compras` ORDER BY codigo ASC
SELECT * FROM `orc_empenhos` WHERE (id != 1 and codigo like '%xxxx%') ORDER BY id DESC
SELECT * FROM `orc_uni_despesas` WHERE (ano = 2018)
SELECT * FROM `orc_fichas` WHERE (ano = 2018) ORDER BY ficha ASC
SELECT * FROM `orc_pedido_compras` WHERE (`orc_pedido_compras`.`id` = 548)
---
 def load_iniciais
        @pedidos_compra = OrcPedidoCompra.all(:order => 'codigo ASC')
        @empenhos= OrcEmpenho.all(:order => 'codigo ASC')
        @despesas = OrcUniDespesa.all(:conditions => ["ano = ?", Time.now.year])
        @fichas_emp = OrcFicha.all(:conditions => ["ano = ?", Time.now.year], :order => 'ficha ASC')
        @fichas = OrcEmpenho.find_by_sql("SELECT DISTINCT (fc.ficha) as ficha, emp.orc_pedido_compra_id, fc.id FROM orc_empenhos emp INNER JOIN orc_pedido_compras pc ON emp.orc_pedido_compra_id = pc.id INNER JOIN orc_fichas fc ON pc.orc_ficha_id = fc.id WHERE (fc.ano = "+(Time.now.year).to_s+" AND emp.id !=1 ) ORDER BY fc.ficha ASC")
        #@atas = OrcAta.find(:all, :conditions => ["DATE_ADD(data, INTERVAL 1 YEAR) > NOW()" ])
        @orcamentarias= OrcUniOrcamentaria.find(:all, :conditions => ["ano = ?", Time.now.year])
        @orc_pedido_ano= OrcPedidoCompra.find(:all, :select => 'distinct(ano)')

SELECT * FROM `orc_empenhos` WHERE (`orc_empenhos`.`id` = 123)
SELECT * FROM `orc_empenho_itens` WHERE (orc_empenho_id=123 )
---
  def show
    @orc_empenho = OrcEmpenho.find(params[:id])
    @orc_empenho_itens = OrcEmpenhoIten.find(:all, :conditions => ['orc_empenho_id=? ',@orc_empenho.id ])

SELECT * FROM `orc_empenhos` WHERE (`orc_empenhos`.`id` = 123)
SELECT * FROM `orc_empenho_itens` WHERE (orc_empenho_id=123 )
---
  def edit
    @orc_empenho = OrcEmpenho.find(params[:id])
    @orc_empenho_itens = OrcEmpenhoIten.find(:all, :conditions => ['orc_empenho_id=? ',@orc_empenho.id ])

INSERT INTO `orc_empenhos` (`ficha_id`, `validade`, `valor_total`, `orc_pedido_compra_id`, `cnpj`, `pago`, `data_chegou`, `projeto`, `data_pg`, `created_at`, `updated_at`, `vencimento`, `pagamento`, `data`, `obs`, `interessado`, `destinacao`, `cancelado`, `codigo`, `processo`, `npedido`, `modalidade`, `ficha`, `cat_economica`, `despesa`) VALUES(NULL, '2018-10-24', 0.0, 549, NULL, 0, '2018-10-22', 'MANUTENÇÃO DA ASSISTÊNCIA AO EDUCANDO', NULL, '2018-10-22 14:07:54', '2018-10-22 14:07:54', '2018-10-04', 0, '2018-10-22', 'ZXCZXCZXCZXCZXCZXC', 'TESTEZZZ', 'GABINETE E DEPENDÊNCIAS', 0, 'testezzz', 'testezzz', 'testezzz', 'PREGÃO PRESENCIAL', '320', NULL, 'GABINETE E DEPENDÊNCIAS')
SELECT * FROM `orc_fichas` WHERE (`orc_fichas`.`id` = 89)
SELECT * FROM `orc_pedido_descricaos` WHERE (orc_pedido_compra_id ='292')
INSERT INTO `orc_empenho_itens` (`quantidade`, `total`, `total_geral`, `obs`, `unitario`, `updated_at`, `medida`, `created_at`, `descricao`, `orc_empenho_id`, `saldo`) VALUES(1090.0, 8066.0, 65120.0, NULL, 7.4, '2018-10-18 19:13:39', NULL, '2018-10-18 19:13:39', 'GOIABA VERMELHA', 148, 1090.0)
UPDATE `orc_empenhos` SET `valor_total` = 1280.0, `updated_at` = '2018-10-17 14:00:46' WHERE `id` = 126
---
  def create
      @orc_empenho = OrcEmpenho.new(params[:orc_empenho])

    respond_to do |format|
      if @orc_empenho.save
        session[:news_itens]= @orc_empenho.id
        @ficha = OrcFicha.find(:all, :conditions => ['id =?',  session[:ficha_id]])
        @orc_empenho.ficha_id=@ficha[0].id
        @orc_empenho.ficha=@ficha[0].ficha
        @orc_empenho.save
          if session[:create_new_itens]== 1
             session[:create_new_itens]= 0
          end
          empenho=@orc_empenho.id
          @empenho = OrcEmpenho.find(:all, :conditions =>['id=?',empenho])
           if  session[:sem_si]==1
               @itens_compra = OrcPedidoDescricao.find(:all, :conditions => ["orc_pedido_compra_id =?" , session[:compra]])

                  for item_compra in @itens_compra
                      valor_item=item_compra.total
                      session[:create_new_itens]=1
                      @orc_empenho_item = OrcEmpenhoIten.new(params[empenho])
                      @orc_empenho_item.orc_empenho_id = empenho
                      @orc_empenho_item.quantidade = item_compra.quantidade
                      @orc_empenho_item.saldo = item_compra.quantidade
                      @orc_empenho_item.descricao = item_compra.descricao
                      @orc_empenho_item.unitario = item_compra.unitario
                      @orc_empenho_item.total = item_compra.total
                      @orc_empenho_item.total_geral = item_compra.total_geral
                      session[:valor_total] = @orc_empenho_item.total_geral
                      @orc_empenho_item.save
                               # salva items do empenho
                      @orc_empenho.valor_total= session[:valor_total]
                      @orc_empenho.save

SELECT * FROM `orc_empenhos` WHERE (`orc_empenhos`.`id` = 123)
SELECT * FROM `orc_fichas` WHERE (`orc_fichas`.`id` = 7)
SELECT * FROM `orc_empenho_itens` WHERE (orc_empenho_id ='123')
UPDATE `orc_fichas` SET `updated_at` = '2018-10-17 14:28:46', `saldo_empenhado` = 1028419.51, `saldo` = 297728.82 WHERE `id` = 89
SELECT * FROM `orc_atas` WHERE (id =5)
SELECT * FROM `orc_ata_itens` WHERE (orc_ata_id=5 AND descricao='ATAXATAX')
UPDATE `orc_ata_itens` SET `updated_at` = '2018-10-17 17:01:27', `saldo` = -12.0 WHERE `id` = 327
---
  def update
        @orc_empenho = OrcEmpenho.find(params[:id])

     if session[:created]== 1
       @ficha = OrcFicha.find(:all, :conditions => ['id =?',  session[:ficha_id]])
       @itens_empenho = OrcEmpenhoIten.find(:all, :conditions => ["orc_empenho_id =?" , params[:id]])
       empenhado= @ficha[0].saldo_empenhado
       saldo = @ficha[0].saldo
          for item in @itens_empenho
              valor_item=item.total
                      # Atualiza saldo na ficha
              empenhado= empenhado + valor_item
              saldo = saldo - valor_item
           end
         @ficha[0].saldo = saldo
         @ficha[0].saldo_empenhado = empenhado
         @ficha[0].save
         if !@orc_empenho.orc_pedido_compra_id.nil?
               @ata = OrcAta.find(:all, :conditions=>['id =?', @orc_empenho.orc_pedido_compra.ata_id])
                 if !@ata[0].id.nil?
                   @itens_empenho = OrcEmpenhoIten.find(:all, :conditions=>['orc_empenho_id=?',@orc_empenho.id ])
                          for item in @itens_empenho
                             #id=@orc_empenho.orc_empenho_iten.id
                             @oc_ata_item = OrcAtaIten.find(:all, :conditions=>['orc_ata_id=? AND descricao=?', @ata[0].id, item.descricao])
                             saldo_anterior= @oc_ata_item[0].saldo
                             teste=@oc_ata_item[0].id
                             quantidade=item.quantidade
                             saldo_atualizado= saldo_anterior- quantidade
                             @oc_ata_item[0].saldo =  saldo_atualizado
                             item.saldo = saldo_atualizado
                             @oc_ata_item[0].save

UPDATE `orc_empenhos` SET `obs` = 'TESTETETETETETE', `updated_at` = '2018-10-19 14:43:05' WHERE `id` = 149
---
                             item.save
                          end
                 end
                  @orc_empenho.save

INSERT INTO `orc_empenho_itens` (`descricao`, `total`, `created_at`, `updated_at`, `quantidade`, `medida`, `total_geral`, `obs`, `saldo`, `orc_empenho_id`, `unitario`) VALUES('PAGAMENTO ZXZXZXZ', 100.0, '2018-10-22 14:21:53', '2018-10-22 14:21:53', 1.0, NULL, NULL, NULL, 0.0, 152, 100.0)
SELECT * FROM `orc_empenho_itens` WHERE (orc_empenho_id =123)
SELECT * FROM `orc_empenhos` WHERE (`orc_empenhos`.`id` = 123)
UPDATE `orc_empenhos` SET `valor_total` = 100.0, `updated_at` = '2018-10-22 14:21:53' WHERE `id` = 152
SELECT * FROM `orc_fichas` WHERE (`orc_fichas`.`id` = 7)
---
 def create_orc_empenho_item
   session[:create_new_itens]=1
   @orc_empenho_item = OrcEmpenhoIten.new(params[:orc_empenho_item])
      valor_item= @orc_empenho_item.total

      @orc_empenho_item.orc_empenho_id = session[:news_itens]
            # salva items do empenho
      if @orc_empenho_item.save
         @orc_empenho_itens=OrcEmpenhoIten.find(:all, :conditions =>['orc_empenho_id =?', session[:news_itens]])

        for item in @orc_empenho_itens

          session[:soma]=session[:soma].to_f+item.total.to_f
          item.total_geral=session[:soma].to_f
          session[:valor_total] = item.total_geral
          item_empenho_id = item.orc_empenho_id
          item.save
        end
          # salva valor_total no empenho
         @orc_empenho= OrcEmpenho.find(item_empenho_id)
         @orc_empenho.valor_total= session[:valor_total]
         #session[:ata] = @orc_empenho.ata
         @orc_empenho.save

          if session[:atualiza_ficha] == 1
             # Atualiza saldo na ficha
            @ficha = OrcFicha.find(:all, :conditions => ['id =?', @orc_empenho.ficha_id])

UPDATE `orc_fichas` SET `updated_at` = '2018-10-17 18:27:05', `saldo` = 382295.68, `saldo_empenhado` = 137704.32 WHERE `id` = 7
---
            saldo = @ficha[0].saldo
            @ficha[0].saldo_empenhado = empenhado + valor_item
            @ficha[0].saldo = saldo - valor_item
            @ficha[0].save

SELECT * FROM `orc_empenho_itens` WHERE (`orc_empenho_itens`.`id` = 441)
SELECT * FROM `orc_fichas` WHERE (`orc_fichas`.`id` = 7)
UPDATE `orc_empenhos` SET `valor_total` = 1542.8, `updated_at` = '2018-10-22 14:08:28' WHERE `id` = 151
UPDATE `orc_fichas` SET `saldo_empenhado` = 1573924.23, `saldo` = 1534960.77, `updated_at` = '2018-10-22 14:08:27' WHERE `id` = 8
DELETE FROM `orc_empenho_itens` WHERE `id` = 441
UPDATE `orc_empenho_itens` SET `total_geral` = 1244.8, `updated_at` = '2018-10-22 14:08:27' WHERE `id` = 475
---
 def destroy_itens

#    @orc_pedido_descricao = OrcPedidoDescricao.find(params[:id])
    @orc_empenho_iten = OrcEmpenhoIten.find(params[:id])
    w= session[:id_empenho]= @orc_empenho_iten.orc_empenho_id
    valor_item = @orc_empenho_iten.total
    @empenho = OrcEmpenho.find(:all, :conditions => ['id = ?', session[:id_empenho]])
     if session[:atualiza_ficha] == 1
              # Atualiza saldo na ficha
            @ficha = OrcFicha.find(:all, :conditions => ['id =?', @empenho[0].ficha_id])
            empenhado= @ficha[0].saldo_empenhado
            saldo = @ficha[0].saldo
            @ficha[0].saldo_empenhado = empenhado - valor_item
            @ficha[0].saldo = saldo + valor_item
            @ficha[0].save
            session[:atualiza_ficha] = 0
     end
     @orc_empenho_iten.destroy
    # salva valor_total no empenho
    @orc_empenho_itens=OrcEmpenhoIten.find(:all, :conditions =>['orc_empenho_id =?', session[:id_empenho] ])
    for item in @orc_empenho_itens
          session[:soma]=session[:soma].to_f + item.total.to_f
          item.total_geral=session[:soma].to_f
          item.save

SELECT `orc_empenhos`.* FROM `orc_empenhos` LEFT JOIN orc_pedido_compras ON orc_empenhos.orc_pedido_compra_id = orc_pedido_compras.id WHERE (orc_pedido_compras.codigo like '%ata%') ORDER BY id DESC
---
  def consulta_empenho
    if params[:type_of].to_i == 1   #fornecedor
         @empenhos = OrcEmpenho.find(:all,:conditions => ['id != 1 and interessado like ?', "%" + params[:search_fornecedor].to_s + "%"], :order => 'id DESC')
          render :update do |page|
                  page.replace_html 'empenho', :partial => "empenhos"
          end
    else if params[:type_of].to_i == 3   #emepnho            produto(antigo)
                  @empenhos = OrcEmpenho.find(:all,:conditions => ['id != 1 and codigo like ?', "%" + params[:search_empenho].to_s + "%"], :order => 'id DESC')
               render :update do |page|
                  page.replace_html 'empenho', :partial => "empenhos"
               end
         else if params[:type_of].to_i == 4   #todas

                 @empenhos = OrcEmpenho.find(:all, :joins=>['LEFT JOIN orc_pedido_compras ON orc_empenhos.orc_pedido_compra_id = orc_pedido_compras.id'], :conditions => ['orc_pedido_compras.codigo like ?', "%" + params[:search_si].to_s + "%"], :order => 'id DESC')

SELECT orc_empenho_itens.id AS item_id, orc_empenho_itens.descricao AS produto, orc_empenho_itens.quantidade AS quantidade, orc_empenhos.interessado AS fornecedor, orc_empenhos.codigo AS nempenho, orc_empenho_itens.saldo AS saldo, (date_format(orc_empenhos.data,"%d/%m/%Y")) AS datae , (date_format(orc_empenhos.data_chegou,"%d/%m/%Y")) AS datac, orc_empenhos.cancelado AS cancelado, orc_nota_fiscals.nf AS nnf , orc_nota_fiscal_itens.quantidade as quantidade_nf FROM `orc_empenhos` LEFT JOIN orc_empenho_itens ON orc_empenho_itens.orc_empenho_id = orc_empenhos.id LEFT JOIN orc_nota_fiscals ON orc_nota_fiscals.orc_empenho_id = orc_empenhos.id LEFT JOIN orc_nota_fiscal_itens ON orc_nota_fiscals.id = orc_nota_fiscal_itens.orc_nota_fiscal_id WHERE (orc_empenho_itens.descricao like '%CHUCHU%' and orc_nota_fiscal_itens.descricao = orc_empenho_itens.descricao) ORDER BY orc_nota_fiscals.nf DESC, orc_nota_fiscal_itens.id ASC
---
 def consulta_empenho_produto

    if params[:type_of].to_i == 1   #fornecedor
         @produtos= OrcEmpenho.find(:all, :joins=> 'LEFT JOIN orc_empenho_itens ON orc_empenho_itens.orc_empenho_id = orc_empenhos.id LEFT JOIN orc_nota_fiscals ON orc_nota_fiscals.orc_empenho_id = orc_empenhos.id LEFT JOIN orc_nota_fiscal_itens ON orc_nota_fiscals.id = orc_nota_fiscal_itens.orc_nota_fiscal_id',  :select => 'orc_empenho_itens.id AS item_id, orc_empenho_itens.descricao AS produto, orc_empenho_itens.quantidade AS quantidade, orc_empenhos.interessado AS fornecedor,  orc_empenhos.codigo AS nempenho, orc_empenho_itens.saldo AS saldo,   (date_format(orc_empenhos.data,"%d/%m/%Y")) AS datae , (date_format(orc_empenhos.data_chegou,"%d/%m/%Y")) AS datac, orc_empenhos.cancelado AS cancelado, orc_nota_fiscals.nf AS nnf , orc_nota_fiscal_itens.quantidade as quantidade_nf',  :conditions => ['orc_empenhos.interessado like ? and orc_nota_fiscal_itens.descricao = orc_empenho_itens.descricao' , "%" +  params[:search_fornecedor].to_s + "%" ], :order => 'orc_nota_fiscals.nf DESC, orc_nota_fiscal_itens.id ASC' )