app/controllers/orc_pedido_compras_controller.rb

SELECT * FROM `orc_fichas` WHERE (ano = 2018) ORDER BY ficha ASC
SELECT * FROM `orc_atas` WHERE (DATE_ADD(data, INTERVAL 1 YEAR) > NOW())
SELECT * FROM `orc_pedido_compras` WHERE (id != 1 and fornecedor like '%TEST%') ORDER BY id DESC
SELECT * FROM `orc_fichas` WHERE (`orc_fichas`.`id` = 58)
SELECT * FROM `orc_pedido_compras` WHERE (`orc_pedido_compras`.`codigo` = 'TESTE1') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
---
 def load_iniciais
        session[:current_user] = current_user.id
        @fichas = OrcFicha.all(:conditions => ["ano = ?", Time.now.year], :order => 'ficha ASC')
        @atas = OrcAta.find(:all, :conditions => ["DATE_ADD(data, INTERVAL 1 YEAR) > NOW()" ])
        @orc_pedido_ano= OrcPedidoCompra.find(:all, :select => 'distinct(ano)')
        if current_user.has_role?('admin') or current_user.has_role?('SEDUC')
           @orc_pedido_si= OrcPedidoCompra.find(:all, :select => 'codigo', :conditions => ['ano= ? ', Time.now.year], :order => 'codigo DESC')
        else if (current_user.login == 'merenda.adriana')or (current_user.login == 'merenda.fabiana')or (current_user.login == 'merenda.claudete')  #excessão dos usuáriosda merenda
              @orc_pedido_si= OrcPedidoCompra.find(:all, :select => 'codigo', :conditions => ['ano= ? and (user_id = 523  or user_id = 525 or user_id=528)', Time.now.year], :order => 'codigo DESC')

             else if (current_user.login == 'adriana_turquiai')or (current_user.login == 'seduc.celso') #excessão dos usuáriosda merenda
              @orc_pedido_si= OrcPedidoCompra.find(:all, :select => 'codigo', :conditions => ['ano= ? and (user_id = 196  or user_id = 524) ', Time.now.year], :order => 'codigo DESC')

                  else
                     @orc_pedido_si= OrcPedidoCompra.find(:all, :select => 'codigo', :conditions => ['ano= ? and user_id = ?', Time.now.year, current_user.id], :order => 'codigo DESC')

SELECT * FROM `orc_pedido_descricaos` WHERE (orc_pedido_compra_id=537 )
---
  def show

    @orc_pedido_compra = OrcPedidoCompra.find(params[:id])
    @orc_pedido_descricaos = OrcPedidoDescricao.find(:all, :conditions => ['orc_pedido_compra_id=? ',@orc_pedido_compra.id ])

SELECT * FROM `orc_pedido_descricaos` WHERE (orc_pedido_compra_id=537 )
---
  def edit
    @orc_pedido_compra = OrcPedidoCompra.find(params[:id])
    @orc_pedido_descricaos = OrcPedidoDescricao.find(:all, :conditions => ['orc_pedido_compra_id=? ',@orc_pedido_compra.id ])

INSERT INTO `orc_pedido_compras` (`orc_ficha_id`, `objetivo`, `valor_total`, `cnpj`, `devolucao`, `empenhado`, `user_id`, `created_at`, `updated_at`, `fornecedor`, `justificativa`, `obs`, `ata_id`, `cancelado`, `codigo`, `ano`) VALUES(8, 'TESTEZZZ', NULL, 'testezzz', NULL, 0, NULL, '2018-10-22 14:01:02', '2018-10-22 14:01:02', 'TESTEZZZ', 'TESTEZZZ', 'TESTEZZZ', 7, 0, 'testezzz', NULL)
SELECT * FROM `orc_ata_itens` WHERE (orc_ata_id ='1')
---
  def create
    @orc_pedido_compra = OrcPedidoCompra.new(params[:orc_pedido_compra])
    #@orc_pedido_compra.codigo=(@orc_pedido_compra.id)
    respond_to do |format|
      if @orc_pedido_compra.save
        session[:news_itens]= @orc_pedido_compra.id
       #? @ficha = OrcFicha.find(:all, :conditions => ['id =?',  session[:ficha_id]])
       # @orc_empenho.ficha_id=@ficha[0].id
       # @orc_empenho.ficha=@ficha[0].ficha
       # @orc_empenho.save
          if session[:create_new_itens]== 1
             session[:create_new_itens]= 0
          end
          pedido=@orc_pedido_compra.id
          @pedido = OrcPedidoCompra.find(:all, :conditions =>['id=?',pedido])
           if  session[:sem_ata]==1
               @itens_pedido = OrcAtaIten.find(:all, :conditions => ["orc_ata_id =?" , session[:ata]])

INSERT INTO `orc_pedido_descricaos` (`saldo`, `orc_ata_item_id`, `orc_pedido_compra_id`, `quantidade`, `total_geral`, `obs`, `item`, `medida`, `unitario`, `total`, `descricao`, `updated_at`, `created_at`) VALUES(20, 1, 537, 20.0, 14.0, NULL, 1, 'UNID.', 0.7, 14.0, 'ADAPTADOR SOLDÁVEL CURTO DE 25MM X 3/4', '2018-10-16 17:59:02', '2018-10-16 17:59:02')
UPDATE `orc_pedido_compras` SET `ano` = 2018, `ata_id` = 5, `created_at` = '2018-10-17 14:11:54', `objetivo` = 'TESTE2XXX', `updated_at` = '2018-10-17 14:11:54', `fornecedor` = 'TESTE2XXXTESTE2XXX', `codigo` = 'TESTE2xxx', `cnpj` = '', `justificativa` = 'TESTE2XXX', `orc_ficha_id` = 7, `obs` = 'TESTE2XXX' WHERE `id` = 539
---
                      @orc_pedido_descricao.total = descricao_compra.total
                      @orc_pedido_descricao.total_geral = descricao_compra.total_geral
                      session[:valor_total] = @orc_pedido_descricao.total_geral
                      @orc_pedido_descricao.save
                               # salva valor total no pedido_compra
                      @orc_pedido_compra.valor_total= session[:valor_total]
                      @orc_pedido_compra.save

UPDATE `orc_pedido_compras` SET `obs` = 'XXXXXX', `updated_at` = '2018-10-19 14:54:07' WHERE `id` = 548
SELECT * FROM `orc_pedido_descricaos` WHERE (orc_pedido_compra_id=537)
SELECT * FROM `orc_ata_itens` WHERE (`orc_ata_itens`.`id` = 1)
UPDATE `orc_ata_itens` SET `saldo` = 0.0, `updated_at` = '2018-10-16 17:59:24' WHERE `id` = 1
---
  def update
    @orc_pedido_compra = OrcPedidoCompra.find(params[:id])
    session[:destino]= params[:destino]

    if session[:show_destino]==1
        respond_to do |format|
          if @orc_pedido_compra.update_attributes(params[:orc_pedido_compra])
            flash[:notice] = 'SALVO COM SUCESSO.'
            format.html { redirect_to( {:action => "destino", :id =>@orc_pedido_compra.id} ) }
            format.xml  { head :ok }
          else
            format.html { render :action => "edit" }
            format.xml  { render :xml => @orc_pedido_compra.errors, :status => :unprocessable_entity }
          end
        end
       session[:show_destino]=0
    else
        respond_to do |format|
          if @orc_pedido_compra.update_attributes(params[:orc_pedido_compra])

              @ata = OrcAta.find(:all, :conditions=>['id =?', @orc_pedido_compra.ata_id])
              @itens_pedido = OrcPedidoDescricao.find(:all, :conditions=>['orc_pedido_compra_id=?',@orc_pedido_compra.id ])
              if !@orc_pedido_compra.ata_id.nil?
                      for descricao_compra in @itens_pedido
                         @oc_ata_item = OrcAtaIten.find(descricao_compra.orc_ata_item_id)
                         saldo_anterior= @oc_ata_item.saldo
                         quantidade= descricao_compra.quantidade
                         saldo_atualizado= saldo_anterior- quantidade
                         @oc_ata_item.saldo =  saldo_atualizado
                         descricao_compra.saldo = saldo_atualizado
                         @oc_ata_item.save

DELETE FROM `orc_pedido_compras` WHERE `id` = 545
---
  def destroy
    @orc_pedido_compra = OrcPedidoCompra.find(params[:id])
    #@orc_pedido_descricao = OrcPedidoDescricao.find( :all,:select => ['id'],:conditions => ["orc_pedido_compra_id =?" , params[:id]])
    @orc_pedido_compra.destroy

INSERT INTO `orc_pedido_descricaos` (`obs`, `updated_at`, `item`, `total`, `total_geral`, `medida`, `unitario`, `created_at`, `saldo`, `descricao`, `quantidade`, `orc_pedido_compra_id`, `orc_ata_item_id`) VALUES(NULL, '2018-10-17 14:11:23', NULL, 12.0, 0.0, 'TESTE1XXX', 12.0, '2018-10-17 14:11:23', NULL, 'TESTE1XXX', 1.0, 538, NULL)
SELECT * FROM `orc_pedido_descricaos` WHERE (orc_pedido_compra_id =538)
UPDATE `orc_pedido_compras` SET `valor_total` = 12.0, `updated_at` = '2018-10-17 14:11:23' WHERE `id` = 538
---
  def create_orc_pedido_descricao
      @orc_pedido_descricao = OrcPedidoDescricao.new(params[:orc_pedido_descricao])


      @orc_pedido_compra= OrcPedidoCompra.find(session[:news_decricao])
      #@orc_pedido_compra.id
      @orc_pedido_descricao.orc_pedido_compra_id = session[:news_decricao]

      if @orc_pedido_descricao.save
        @orc_pedido_descricaos=OrcPedidoDescricao.find(:all, :conditions =>['orc_pedido_compra_id =?', session[:news_decricao] ])
        session[:quant_item]= @orc_pedido_descricao.quantidade
        cont = 0
        for descricao in @orc_pedido_descricaos
          cont=cont+1
          session[:soma]=session[:soma].to_f+descricao.total.to_f
          descricao.total_geral=session[:soma].to_f
          total_geral=descricao.total_geral
          descricao.item = cont
          descricao.save
        end

         @orc_pedido_compra.valor_total = total_geral
         #w=session[:ata]= @orc_pedido_compra.ata
         @orc_pedido_compra.save

SELECT `orc_pedido_compras`.* FROM `orc_pedido_compras` LEFT JOIN orc_empenhos ON orc_empenhos.orc_pedido_compra_id = orc_pedido_compras.id WHERE (`orc_pedido_compras`.`id` IN (310,313,317,351))
---
   def si_selecionados
      w=session[:pedido_ids]=params[:pedido_ids]
      t=0
      #@chamados = Chamado.find(params[:chamado_ids], :joins => "LEFT JOIN "+session[:base]+".unidades uni ON uni.id = chamados.unidade_id")
      #@orc_pedido_compra= OrcPedidoCompra.find_by_sql("SELECT opc . * FROM `orc_pedido_compras` opc LEFT JOIN orc_empenhos oe ON oe.orc_pedido_compra_id = opc.id WHERE oe.id IS NULL)
      @orc_pedido_compra = OrcPedidoCompra.find(session[:pedido_ids], :joins => "LEFT JOIN orc_empenhos ON orc_empenhos.orc_pedido_compra_id = orc_pedido_compras.id ")

SELECT `orc_pedido_compras`.* FROM `orc_pedido_compras` LEFT JOIN orc_empenhos ON orc_empenhos.orc_pedido_compra_id = orc_pedido_compras.id WHERE (`orc_pedido_compras`.`id` IN (310,313,317,351))
---
def impressao_sem_empenho
    @orc_pedido_compra = OrcPedidoCompra.find(session[:pedido_ids], :joins => "LEFT JOIN orc_empenhos ON orc_empenhos.orc_pedido_compra_id = orc_pedido_compras.id ")