app/controllers/orc_nota_fiscals_controller.rb

SELECT * FROM `orc_empenhos` WHERE (date_format(data_chegou,'%Y') = 2018) ORDER BY codigo DESC
SELECT * FROM `orc_fichas` WHERE (ano = 2018) ORDER BY ficha ASC
---
    def load_iniciais
        #@pedidos_compra = OrcPedidoCompra.all(:order => 'codigo ASC')
        @empenhos = OrcEmpenho.all(:conditions => ["date_format(data_chegou,'%Y') = ?", Time.now.year],:order => 'codigo DESC')
        @fichas_emp = OrcFicha.all(:conditions => ["ano = ?", Time.now.year], :order => 'ficha ASC')

SELECT * FROM `orc_nota_fiscals` WHERE (`orc_nota_fiscals`.`id` = 44)
SELECT * FROM `orc_empenhos` WHERE (`orc_empenhos`.`id` = 125)
SELECT * FROM `orc_nota_fiscal_itens` WHERE (orc_nota_fiscal_id=44)
---
    def show
        @orc_nota_fiscal = OrcNotaFiscal.find(params[:id])
        id_ficha= @orc_nota_fiscal.orc_empenho.ficha_id
        @ficha = OrcFicha.find(:all, :conditions=> ['id = ?', id_ficha])
        @orc_nota_fiscal_itens= OrcNotaFiscalIten.find(:all, :conditions => ['orc_nota_fiscal_id=?', @orc_nota_fiscal.id])

SELECT * FROM `orc_nota_fiscals` WHERE (`orc_nota_fiscals`.`id` = 44)
SELECT * FROM `orc_nota_fiscal_itens` WHERE (orc_nota_fiscal_id =44 )
---
    def itens_na_nota_fiscal
        @orc_nota_fiscal = OrcNotaFiscal.find(params[:id])
        session[:empenho_id]=@orc_nota_fiscal.orc_empenho_id
        @orc_nota_fiscal_itens = OrcNotaFiscalIten.find(:all, :conditions => ['orc_nota_fiscal_id =? ',@orc_nota_fiscal.id ])

INSERT INTO `orc_nota_fiscals` (`data_nf`, `nf`, `valor`, `updated_at`, `obs`, `orc_empenho_id`, `data_prod`, `created_at`) VALUES('2018-10-16', '123xxx', NULL, '2018-10-17 13:28:57', NULL, 125, '2018-10-17', '2018-10-17 13:28:57')
SELECT * FROM `orc_nota_fiscals` WHERE (id=44)
SELECT * FROM `orc_empenho_itens` WHERE (orc_empenho_id ='125')
INSERT INTO `orc_nota_fiscal_itens` (`descricao`, `total`, `created_at`, `updated_at`, `orc_nota_fiscal_id`, `quantidade`, `medida`, `total_geral`, `obs`, `unitario`) VALUES('GOIABA VERMELHA', 4440.0, '2018-10-19 17:49:35', '2018-10-19 17:49:35', 45, 7100.0, NULL, 65120.0, NULL, 7.4)
UPDATE `orc_nota_fiscals` SET `valor` = 65120.0, `updated_at` = '2018-10-19 17:49:35' WHERE `id` = 45
---
    def create
        session[:altera_saldo_edicao_nfitem]= 0
        session[:edita_item]=0
        session[:quantidade]=0
        @orc_nota_fiscal = OrcNotaFiscal.new(params[:orc_nota_fiscal])

        respond_to do |format|
            if @orc_nota_fiscal.save
                session[:news_itens]= @orc_nota_fiscal.id
                nota_fiscal=@orc_nota_fiscal.id
                @nota_fiscal = OrcNotaFiscal.find(:all, :conditions =>['id=?',nota_fiscal])
                if  session[:sem_emp]==1
                    @itens_empenho = OrcEmpenhoIten.find(:all, :conditions => ["orc_empenho_id =?" , session[:empenho_id]])
                    for item_nf in @itens_empenho
                        valor_item=item_nf.total
                        session[:create_new_itens]=1
                        @orc_nota_fiscal_item = OrcNotaFiscalIten.new(params[nota_fiscal])
                        @orc_nota_fiscal_item.orc_nota_fiscal_id = nota_fiscal
                        @orc_nota_fiscal_item.quantidade = item_nf.saldo
                        @orc_nota_fiscal_item.descricao = item_nf.descricao
                        @orc_nota_fiscal_item.unitario = item_nf.unitario
                        @orc_nota_fiscal_item.total = item_nf.total
                        session[:valor_total]= @orc_nota_fiscal_item.total_geral = item_nf.total_geral
                        # item_nf.saldo = item_nf.quantidade - @orc_nota_fiscal_item.quantidade
                        # item_nf.saldo = item_nf.saldo - @orc_nota_fiscal_item.quantidade
                        @orc_nota_fiscal_item.save
                        # salva items nota_fiscal
                        @orc_nota_fiscal.valor= session[:valor_total]
                        @orc_nota_fiscal.save
                        item_nf.save

SELECT * FROM `orc_nota_fiscals` WHERE (`orc_nota_fiscals`.`id` = 44)
UPDATE `orc_nota_fiscals` SET `valor` = 65120.0, `updated_at` = '2018-10-19 17:49:59' WHERE `id` = 45
SELECT * FROM `orc_nota_fiscal_itens` WHERE (orc_nota_fiscal_id = 44)
SELECT * FROM `orc_empenho_itens` WHERE (orc_empenho_id =125 )
---
    def update
        @orc_nota_fiscal = OrcNotaFiscal.find(params[:id])
        @orc_nota_fiscal.nf

        respond_to do |format|
            if @orc_nota_fiscal.update_attributes(params[:orc_nota_fiscal])
                id_empenho=@orc_nota_fiscal.orc_empenho_id
                if  session[:sem_emp]==1
                    #@itens_empenho = OrcEmpenhoIten.find(:all, :conditions => ["orc_empenho_id =?" , session[:empenho_id]])

             t=0
                    @orc_nota_fiscal_item = OrcNotaFiscalIten.find(:all, :conditions => ['orc_nota_fiscal_id = ?',@orc_nota_fiscal.id])
                    for item_nf in @orc_nota_fiscal_item
                        @itens_empenho = OrcEmpenhoIten.find(:all, :conditions => ["orc_empenho_id =? " , session[:empenho_id],])

SELECT * FROM `orc_empenhos` WHERE (`orc_empenhos`.`id` = 125)
SELECT `orc_nota_fiscals`.* FROM `orc_nota_fiscals` INNER JOIN orc_empenhos ON orc_empenhos.id = orc_nota_fiscals.orc_empenho_id WHERE ( orc_empenhos.codigo like '%xxx1%') ORDER BY id DESC
---
    def consulta_nf
        if params[:type_of].to_i == 1   #fornecedor
            @nota_fiscals = OrcNotaFiscal.find(:all, :joins => [:orc_empenho],:conditions => [' orc_empenhos.interessado like ?', "%" + params[:search_fornecedor_nf].to_s + "%"], :order => 'id DESC')

SELECT * FROM `orc_nota_fiscals` WHERE (`orc_nota_fiscals`.`nf` = '123xxx') LIMIT 1
---
  def ja_existe
         if OrcNotaFiscal.find_by_nf(params[:orc_nota_fiscal_nf]) then