app/controllers/orc_empenho_itens_controller.rb

SELECT * FROM `orc_empenho_itens` WHERE (`orc_empenho_itens`.`id` = 435)
---
  def show
    @orc_empenho_iten = OrcEmpenhoIten.find(params[:id])

SELECT * FROM `orc_empenho_itens` WHERE (`orc_empenho_itens`.`id` = 435)
SELECT * FROM `orc_empenhos` WHERE (id=135)
---
  def edit
      @orc_empenho_iten = OrcEmpenhoIten.find(params[:id])
      @orc_empenho =OrcEmpenho.find(:all, :conditions=>['id=?',@orc_empenho_iten.orc_empenho_id ])

SELECT * FROM `orc_empenho_itens` WHERE (`orc_empenho_itens`.`id` = 435)
SELECT * FROM `orc_empenhos` WHERE (id=135)
UPDATE `orc_empenho_itens` SET `total` = 4440.0, `quantidade` = 600.0, `updated_at` = '2018-10-19 14:33:05' WHERE `id` = 471
---
  def update
    @orc_empenho_iten = OrcEmpenhoIten.find(params[:id])
    @orc_empenho = OrcEmpenho.find(:all, :conditions=> ['id=?', @orc_empenho_iten.orc_empenho_id])
    respond_to do |format|
      if @orc_empenho_iten.update_attributes(params[:orc_empenho_iten])