app/controllers/orc_suplementacaos_controller.rb

SELECT * FROM `orc_pedido_compras` WHERE (empenhado = 0) ORDER BY codigo ASC
SELECT * FROM `orc_uni_despesas` WHERE (ano = 2018)
SELECT * FROM `orc_fichas` WHERE (ano = 2018) ORDER BY ficha ASC
SELECT * FROM `orc_fichas` WHERE (`orc_fichas`.`id` = 8)
SELECT * FROM `orc_uni_despesas` WHERE (`orc_uni_despesas`.`id` = 1)
SELECT * FROM `orc_uni_orcamentarias` WHERE (`orc_uni_orcamentarias`.`id` = 26)
---
 def load_iniciais
        @pedidos_compra = OrcPedidoCompra.all(:conditions =>['empenhado = 0'],:order => 'codigo ASC')
        @despesas = OrcUniDespesa.all(:conditions => ["ano = ?", Time.now.year])
        @fichas = OrcFicha.all(:conditions => ["ano = ?", Time.now.year], :order => 'ficha ASC')

        @orcamentarias= OrcUniOrcamentaria.find(:all, :conditions => ["ano = ?", Time.now.year])

SELECT * FROM `orc_suplementacaos` WHERE (`orc_suplementacaos`.`id` = 1)
---
  def show
    @orc_suplementacao = OrcSuplementacao.find(params[:id])

INSERT INTO `orc_suplementacaos` (`orc_ficha_id`, `created_at`, `updated_at`, `data`, `obs`, `orc_ficha_origem_id`, `destinacao`, `processo`, `orcamentaria`, `valor_suplemento`) VALUES(8, '2018-10-22 14:25:12', '2018-10-22 14:25:12', NULL, NULL, 7, 'xcvxcvxcvxcvxcvxcv', 'xcvxcvxcv', NULL, 10000.0)
UPDATE `orc_fichas` SET `saldo_atual` = 510000.0, `saldo_transferido` = 10000.0, `saldo` = 369871.68, `updated_at` = '2018-10-22 14:25:12' WHERE `id` = 7
---
  def create
    @orc_suplementacao = OrcSuplementacao.new(params[:orc_suplementacao])

    respond_to do |format|
      if @orc_suplementacao.save
             # Atualiza saldo na ficha
        @ficha = OrcFicha.find(:all, :conditions => ['id =?', @orc_suplementacao.orc_ficha_id])
        @ficha_origem = OrcFicha.find(:all, :conditions => ['id =?', @orc_suplementacao.orc_ficha_origem_id])

        saldo_atual= @ficha[0].saldo_atual + @orc_suplementacao.valor_suplemento
        saldo= @ficha[0].saldo + @orc_suplementacao.valor_suplemento
        aporte= @ficha[0].saldo_aporte + @orc_suplementacao.valor_suplemento
        @ficha[0].saldo_atual = saldo_atual
        @ficha[0].saldo = saldo
        w1=@ficha[0].saldo_aporte = aporte.to_f

        saldo_atual= @ficha_origem[0].saldo_atual - @orc_suplementacao.valor_suplemento
        saldo= @ficha_origem[0].saldo - @orc_suplementacao.valor_suplemento
        transferido= @ficha_origem[0].saldo_transferido + @orc_suplementacao.valor_suplemento
        @ficha_origem[0].saldo_atual = saldo_atual
        @ficha_origem[0].saldo = saldo
        @ficha_origem[0].saldo_transferido = transferido.to_f

        @ficha[0].save