app/controllers/orc_fichas_controller.rb

SELECT * FROM `orc_uni_orcamentarias` WHERE (ano = 2018) ORDER BY descricao ASC
SELECT * FROM `orc_uni_despesas` WHERE (ano = 2018)
SELECT * FROM `orc_fichas` WHERE (id = '8') ORDER BY ano ASC, descricao ASC
SELECT * FROM `orc_fichas` WHERE (`orc_fichas`.`id` = 17)
SELECT * FROM `orc_uni_despesas` WHERE (`orc_uni_despesas`.`id` = 1)
SELECT * FROM `orc_uni_orcamentarias` WHERE (`orc_uni_orcamentarias`.`id` = 26)
---
 def load_iniciais
        @orcamentaria = OrcUniOrcamentaria.all(:conditions => ["ano = ?", Time.now.year], :order => 'descricao ASC')
        @despesas = OrcUniDespesa.all(:conditions => ["ano = ?", Time.now.year])
        @fichas_atual = OrcFicha.all(:conditions => ["ano = ?", Time.now.year], :order => 'ficha ASC')
        @fichas = OrcFicha.all(:conditions => ["ano = 2018"], :order => 'ficha ASC')
        @orc_ficha_ano= OrcFicha.find(:all, :select => 'distinct(ano)')
        @orc_ficha_descricao= OrcFicha.find(:all, :select => "distinct(descricao), CONCAT( ano , ' - ',descricao       ) AS descricao_ano", :conditions => ["ano = ?", Time.now.year],:order => ' descricao ASC , ano ASC' )

UPDATE `orc_fichas` SET `saldo_atual` = 1000.0, `saldo_empenhado` = 500.0, `saldo` = 500.0, `updated_at` = '2018-10-22 14:16:05' WHERE `id` = 8
---
  def update
    @orc_ficha = OrcFicha.find(params[:id])

    respond_to do |format|
      if @orc_ficha.update_attributes(params[:orc_ficha])