app/controllers/orc_pedido_descricaos_controller.rb

SELECT * FROM `orc_pedido_descricaos` WHERE (`orc_pedido_descricaos`.`id` = 1141)
SELECT * FROM `orc_pedido_compras` WHERE (id=541)
---
  def edit
    @orc_pedido_descricao = OrcPedidoDescricao.find(params[:id])
    @orc_pedido_compra = OrcPedidoCompra.find(:all, :conditions=> ['id=?', @orc_pedido_descricao.orc_pedido_compra_id])

SELECT * FROM `orc_pedido_descricaos` WHERE (`orc_pedido_descricaos`.`id` = 1141)
SELECT * FROM `orc_pedido_compras` WHERE (id=541)
UPDATE `orc_pedido_descricaos` SET `quantidade` = 7000.0, `total` = 51800.0, `updated_at` = '2018-10-19 14:24:39' WHERE `id` = 1201
---
  def update
    @orc_pedido_descricao = OrcPedidoDescricao.find(params[:id])
    @orc_pedido_compra = OrcPedidoCompra.find(:all, :conditions=> ['id=?', @orc_pedido_descricao.orc_pedido_compra_id])

    respond_to do |format|
      if @orc_pedido_descricao.update_attributes(params[:orc_pedido_descricao])