app/controllers/orc_lancamentos_controller.rb

SELECT * FROM `orc_pedido_compras` ORDER BY codigo ASC
SELECT * FROM `orc_uni_despesas` WHERE (ano = 2018)
SELECT * FROM `orc_fichas` WHERE (ano = 2018) ORDER BY ficha ASC
---
 def load_iniciais
        @pedidos_compra = OrcPedidoCompra.all(:order => 'codigo ASC')
        @despesas = OrcUniDespesa.all(:conditions => ["ano = ?", Time.now.year])
        @fichas_emp = OrcFicha.all(:conditions => ["ano = ?", Time.now.year], :order => 'ficha ASC')