app/controllers/orc_uni_orcamentarias_controller.rb

 def load_iniciais
       @despesas = OrcUniDespesa.all(:conditions => ["ano = ?", Time.now.year])
---
SELECT * FROM `orc_uni_despesas` WHERE (ano = 2018)