app/controllers/orc_ata_itens_controller.rb

SELECT * FROM `orc_ata_itens` WHERE (`orc_ata_itens`.`id` = 327)
SELECT * FROM `orc_atas` WHERE (id=5)
---
  def edit
    @orc_ata_iten = OrcAtaIten.find(params[:id])
    @orc_ata= OrcAta.find(:all, :conditions=>['id=?',@orc_ata_iten.orc_ata_id ])

SELECT * FROM `orc_ata_itens` WHERE (`orc_ata_itens`.`id` = 327)
UPDATE `orc_ata_itens` SET `updated_at` = '2018-10-17 17:03:20', `saldo` = 12.0 WHERE `id` = 327
---
  def update
    @orc_ata_iten = OrcAtaIten.find(params[:id])

    respond_to do |format|
      if @orc_ata_iten.update_attributes(params[:orc_ata_iten])