app/controllers/orc_nota_fiscal_itens_controller.rb

  def edit
      t=0
    @orc_nota_fiscal_iten = OrcNotaFiscalIten.find(params[:id])
    @orc_nota_fiscal = OrcNotaFiscal.find(:all, :conditions=> ['id=?', @orc_nota_fiscal_iten.orc_nota_fiscal_id])
---
SELECT * FROM `orc_nota_fiscal_itens` WHERE (`orc_nota_fiscal_itens`.`id` = 276)
SELECT * FROM `orc_nota_fiscals` WHERE (id=48)

  def update
    @orc_nota_fiscal_iten = OrcNotaFiscalIten.find(params[:id])
    @orc_nota_fiscal = OrcNotaFiscal.find(:all, :conditions=> ['id=?', @orc_nota_fiscal_iten.orc_nota_fiscal_id])
    if session[:edita_item]==1
        session[:quantidade] = @orc_nota_fiscal_iten.quantidade.to_f

    end

    respond_to do |format|
      if @orc_nota_fiscal_iten.update_attributes(params[:orc_nota_fiscal_iten])
         session[:altera_saldo_edicao_nfitem]=1

         #session[:edita_item]=1
         quantidade_iten = @orc_nota_fiscal_iten.quantidade.to_f

         @empenho = OrcEmpenho.find(:all, :joins => "INNER JOIN orc_nota_fiscals ON orc_empenhos.id = orc_nota_fiscals.orc_empenho_id INNER JOIN orc_nota_fiscal_itens ON orc_nota_fiscals.id = orc_nota_fiscal_itens.orc_nota_fiscal_id ", :conditions => ["orc_nota_fiscal_itens.id =?", @orc_nota_fiscal_iten.id])
         empenho = empenho_id= @empenho[0].id
         @empenho_iten= OrcEmpenhoIten.find(:all, :conditions => ['descricao=? and orc_empenho_id=?',@orc_nota_fiscal_iten.descricao , empenho])
---
SELECT * FROM `orc_nota_fiscal_itens` WHERE (`orc_nota_fiscal_itens`.`id` = 276)
SELECT * FROM `orc_nota_fiscals` WHERE (id=48)
UPDATE `orc_nota_fiscal_itens` SET `quantidade` = 50.0, `total` = 307.5, `updated_at` = '2018-10-19 17:54:10' WHERE `id` = 276
SELECT `orc_empenhos`.* FROM `orc_empenhos` INNER JOIN orc_nota_fiscals ON orc_empenhos.id = orc_nota_fiscals.orc_empenho_id INNER JOIN orc_nota_fiscal_itens ON orc_nota_fiscals.id = orc_nota_fiscal_itens.orc_nota_fiscal_id WHERE (orc_nota_fiscal_itens.id =276)
SELECT * FROM `orc_empenho_itens` WHERE (descricao='ALFACE' and orc_empenho_id=30)