app/controllers/orc_atas_controller.rb

SELECT * FROM `orc_atas` WHERE ((DATE_ADD(data, INTERVAL 1 YEAR) >= NOW()) AND (DATE_ADD(data, INTERVAL 1 YEAR) <= DATE_ADD(NOW(), INTERVAL 1 MONTH))) ORDER BY data ASC
SELECT * FROM `orc_fichas` WHERE (ano = 2018) ORDER BY ficha ASC
---
 def load_iniciais
        #@pedidos_compra = OrcPedidoCompra.all(:order => 'codigo ASC')
          #@despesas = OrcUniDespesa.all(:conditions => ["ano = ?", Time.now.year])
        @atas = OrcAta.find(:all, :conditions => ["DATE_ADD(data, INTERVAL 1 YEAR) > NOW()" ])
        @fichas_emp = OrcFicha.all(:conditions => ["ano = ?", Time.now.year], :order => 'ficha ASC')

SELECT * FROM `orc_ata_itens` WHERE (orc_ata_id=6 )
---
  def show
    @orc_ata = OrcAta.find(params[:id])
     @orc_ata_itens = OrcAtaIten.find(:all, :conditions => ['orc_ata_id=? ',@orc_ata.id ])

SELECT * FROM `orc_ata_itens` WHERE (orc_ata_id=6 )
---
  def edit
    @orc_ata = OrcAta.find(params[:id])
    @orc_ata_itens = OrcAtaIten.find(:all, :conditions => ['orc_ata_id=? ',@orc_ata.id ])

INSERT INTO `orc_atas` (`administrativo`, `objetivo`, `valor_total`, `cnpj`, `cep`, `contato`, `numero`, `endereco`, `created_at`, `updated_at`, `estado`, `cidade`, `data`, `obs`, `interessado`, `codigo`, `modalidade`, `fone`, `ie`, `email`) VALUES('testezzzz', 'TESTEZZZZ', NULL, 'testezzzz', 'testezzzz', 'TESTEZZZZ', 'testezzzz', 'TESTEZZZZ', '2018-10-22 13:54:47', '2018-10-22 13:54:47', 'TESTEZZZZ', 'TESTEZZZZ', '2018-10-22', 'TESTEZZZZ', 'TESTEZZZZ', 'testezzzz', 'CONCORRÊNCIA PÚBLICA', 'testezzzz', 'testezzzz', 'testezzzz')
---
  def create
    @orc_ata = OrcAta.new(params[:orc_ata])

    respond_to do |format|
      if @orc_ata.save

INSERT INTO `orc_ata_itens` (`quantidade`, `orc_ata_id`, `total`, `total_geral`, `obs`, `unitario`, `updated_at`, `medida`, `created_at`, `descricao`, `saldo`) VALUES(8800.0, 6, 65120.0, NULL, NULL, 7.4, '2018-10-18 19:01:41', 'KG', '2018-10-18 19:01:41', 'GOIABA VERMELHA', 0.0)
SELECT * FROM `orc_ata_itens` WHERE (orc_ata_id =6)
UPDATE `orc_atas` SET `valor_total` = 900.0, `updated_at` = '2018-10-17 19:19:54' WHERE `id` = 8
---
  def create_orc_ata_item
   #session[:create_new_itens]=1
   @orc_ata_item = OrcAtaIten.new(params[:orc_ata_item])
      valor_item= @orc_ata_item.total

      @orc_ata_item.orc_ata_id = session[:news_itens]
            # salva items da ata
      if @orc_ata_item.save
         @orc_ata_item.saldo=@orc_ata_item.quantidade


         @orc_ata_itens=OrcAtaIten.find(:all, :conditions =>['orc_ata_id =?', session[:news_itens]])

        for item in @orc_ata_itens

          w2=session[:soma]=session[:soma].to_f+item.total.to_f
          item.total_geral=session[:soma].to_f
          w1=session[:valor_total] = item.total_geral
          item_ata_id = item.orc_ata_id
          item.save
        end

         # salva valor_total no empenho
         @orc_ata= OrcAta.find(item_ata_id)
         @orc_ata.valor_total= session[:valor_total]
         @orc_ata.save

SELECT * FROM `orc_ata_itens` WHERE (`orc_ata_itens`.`id` = 331)
DELETE FROM `orc_ata_itens` WHERE `id` = 331
UPDATE `orc_ata_itens` SET `total_geral` = 80900.0, `updated_at` = '2018-10-22 13:54:56' WHERE `id` = 332
UPDATE `orc_atas` SET `valor_total` = 80900.0, `updated_at` = '2018-10-22 13:54:56' WHERE `id` = 7
---
 def destroy_itens
    @orc_ata_iten = OrcAtaIten.find(params[:id])
    session[:id_ata]= @orc_ata_iten.orc_ata_id
    valor_item = @orc_ata_iten.total
    @ata = OrcAta.find(:all, :conditions => ['id = ?', session[:id_ata]])
    @orc_ata_iten.destroy
    # salva valor_total no empenho
    @orc_ata_itens=OrcAtaIten.find(:all, :conditions =>['orc_ata_id =?', session[:id_ata] ])
    for item in @orc_ata_itens
          session[:soma]=session[:soma].to_f + item.total.to_f
          item.total_geral=session[:soma].to_f
          item.save

SELECT orc_ata_itens.id AS item_id, orc_ata_itens.descricao AS produto, orc_ata_itens.quantidade AS quantidade, orc_ata_itens.saldo AS saldo, orc_atas.interessado AS fornecedor, orc_atas.codigo AS codigo_ata, orc_atas.modalidade AS modalidade, orc_atas.administrativo AS processo FROM `orc_atas` LEFT JOIN orc_ata_itens ON orc_ata_itens.orc_ata_id = orc_atas.id WHERE (orc_ata_itens.descricao like '%teste%') ORDER BY orc_atas.codigo DESC, orc_ata_itens.descricao ASC
---
def consulta_ata_produto

    if params[:type_of].to_i == 1   #fornecedor
         #@atas = OrcAta.find(:all,:conditions => ['interessado like ?', "%" + params[:search_fornecedor].to_s + "%"], :order => 'id DESC')
         @atas= OrcAta.find(:all, :joins=> 'LEFT JOIN orc_ata_itens ON orc_ata_itens.orc_ata_id = orc_atas.id ',  :select => 'orc_ata_itens.id AS item_id, orc_ata_itens.descricao AS produto, orc_ata_itens.quantidade AS quantidade, orc_ata_itens.saldo AS saldo,  orc_atas.interessado AS fornecedor,  orc_atas.codigo AS codigo_ata, orc_atas.modalidade AS modalidade, orc_atas.administrativo AS processo', :conditions => ['orc_atas.interessado like ?', "%" + params[:search_fornecedor_saldo].to_s + "%"], :order => 'orc_atas.codigo DESC, orc_ata_itens.descricao ASC' )

SELECT orc_ata_itens.id AS item_id, orc_ata_itens.descricao AS produto, orc_ata_itens.quantidade AS quantidade, orc_ata_itens.saldo AS saldo, orc_atas.interessado AS fornecedor, orc_atas.codigo AS codigo_ata, orc_atas.modalidade AS modalidade, orc_atas.administrativo AS processo FROM `orc_atas` LEFT JOIN orc_ata_itens ON orc_ata_itens.orc_ata_id = orc_atas.id WHERE (orc_atas.id = '5') ORDER BY orc_atas.codigo DESC, orc_ata_itens.descricao ASC
---
def ata_consulta_saldo
     @atas= OrcAta.find(:all, :joins=> 'LEFT JOIN orc_ata_itens ON orc_ata_itens.orc_ata_id = orc_atas.id ',  :select => 'orc_ata_itens.id AS item_id, orc_ata_itens.descricao AS produto, orc_ata_itens.quantidade AS quantidade, orc_ata_itens.saldo AS saldo,  orc_atas.interessado AS fornecedor,  orc_atas.codigo AS codigo_ata, orc_atas.modalidade AS modalidade, orc_atas.administrativo AS processo',  :conditions => ['orc_atas.id = ?', params[:orc_ata_id] ], :order => 'orc_atas.codigo DESC, orc_ata_itens.descricao ASC' )