app/controllers/orc_pagamentos_controller.rb

 def load_iniciais
   #     @pedidos_compra = OrcPedidoCompra.all(:conditions =>['empenhado = 0'],:order => 'codigo ASC')
   #     @despesas = OrcUniDespesa.all(:conditions => ["ano = ?", Time.now.year])
         @fichas = OrcFicha.all(:conditions => ["ano = ?", Time.now.year], :order => 'ficha ASC')
         #@fichas = OrcFicha.find_by_sql("SELECT id, ficha FROM orc_pagamentos WHERE id NOT IN (SELECT orc_ficha_id FROM orc_pagamentos) ORDER BY codigo ASC")
         @orc_pagamento_op= OrcPagamento.find(:all, :conditions => ["year(data_pg) = ? and codigo is not null", Time.now.year], :order => 'data_pg ASC' )
         @empenhos = OrcEmpenho.all(:conditions => ["year(data_chegou) = ? and pagamento=0", Time.now.year], :order => 'data_chegou ASC' )
---
SELECT * FROM `orc_fichas` WHERE (ano = 2018) ORDER BY ficha ASC
SELECT * FROM `orc_fichas` WHERE (`orc_fichas`.`id` = 89)
SELECT * FROM `orc_pagamentos` WHERE (year(data_pg) = 2018 and codigo is not null AND orc_empenho_id is not null) ORDER BY data_pg ASC
SELECT * FROM `orc_empenhos` WHERE (year(data_chegou) = 2018 and pagamento=0) ORDER BY data_chegou ASC

  def create
    @orc_pagamento = OrcPagamento.new(params[:orc_pagamento])
    @orc_pagamento.pago = 1

    respond_to do |format|
      if @orc_pagamento.save
       op_id=@orc_pagamento.id

            # atualiza saldo na ficha
        @ficha = OrcFicha.find(:all, :conditions => ['ficha =?', @orc_pagamento.ficha])
        saldo_atual= @ficha[0].saldo_atual - @orc_pagamento.valor_pg
        saldo= @ficha[0].saldo - @orc_pagamento.valor_pg
        if !@orc_pagamento.orc_empenho_id.nil?
           empenho= @ficha[0].saldo_empenhado - @orc_pagamento.valor_pg
           @ficha[0].saldo_empenhado = empenho
        end
        @ficha[0].saldo_atual = saldo_atual
        @ficha[0].saldo = saldo

        @ficha[0].save
            # Atualiza data pg empenho
        if !@orc_pagamento.orc_empenho_id.nil?
            @op =OrcPagamento.find(op_id)
            @empenho = OrcEmpenho.find(:all, :conditions => ['id =?', @orc_pagamento.orc_empenho_id])
            empenho_id=@empenho[0].orc_pedido_compra_id
            @pedido_compra = OrcPedidoCompra.find(:all , :conditions=> ['id= ?', empenho_id])
---
INSERT INTO `orc_pagamentos` (`orc_ficha_id`, `data_nf`, `valor_pg`, `nnf`, `pago`, `data_pg`, `created_at`, `updated_at`, `interessado`, `codigo`, `orc_empenho_id`, `ficha`, `obs_pg`) VALUES(NULL, '2018-10-09', 34343434.0, 'asdasda', 1, '2018-10-01', '2018-10-22 14:15:05', '2018-10-22 14:15:05', NULL, 'testezzz', 151, NULL, NULL)
UPDATE `orc_fichas` SET `saldo_atual` = -31234547.0, `saldo_empenhado` = -32767966.97, `saldo` = -32810016.03, `updated_at` = '2018-10-22 14:15:05' WHERE `id` = 8
UPDATE `orc_pagamentos` SET `updated_at` = '2018-10-17 12:51:41', `orc_ficha_id` = 89, `codigo` = '18842/2018' WHERE `id` = 5
SELECT * FROM `orc_pedido_compras` WHERE (id= 292)

            @op.ficha = @empenho[0].ficha
            if !@empenho[0].orc_pedido_compra_id.nil?
               @pedido_compra[0].empenhado =1
               @pedido_compra[0].save
               @empenho[0].save
---
UPDATE `orc_pedido_compras` SET `updated_at` = '2018-10-22 14:15:05', `empenhado` = 1 WHERE `id` = 549
UPDATE `orc_empenhos` SET `pagamento` = 1, `updated_at` = '2018-10-17 12:51:41', `data_pg` = '2018-10-02' WHERE `id` = 12