app/controllers/reservar_salas_controller.rb

 def load_servicos_salas
  @servicos_salas = ServicosSala.find(:all)
---
SELECT * FROM `salas` WHERE (status = 1) ORDER BY sala ASC
SELECT * FROM `servicos_salas` WHERE (status = 1)