app/controllers/sessions_controller.rb

  def load_cursos
    @cursos = Curso.find(:all, :order => 'nome ASC', :conditions => ['status = 0'])
---
SELECT * FROM `cursos` WHERE (status = 0)