app/controllers/users_controller.rb

  def load_users
    @users =User.find(:all, :order => 'login ASC')
---
SELECT `users`.id FROM `users` WHERE (`users`.`login` = BINARY 'ngarcia' AND `users`.id <> 2) LIMIT 1

  def load_resources
    @unidades = Unidade.all
---
SELECT * FROM `unidades` ORDER BY nome ASC